R1# sh run
Building configuration...

Current configuration:
!
frr version 8.1
frr defaults traditional
hostname R1
no ipv6 forwarding
service integrated-vtysh-config
!
interface eth0
 ip address 10.1.0.10/24
 ip ospf area 0
exit
!
interface eth1
 ip address 192.168.0.1/24
exit
!
interface eth2
 ip address 192.168.1.1/24
exit
!
interface lo
 ip address 10.151.0.1/24
exit
!
router bgp 100
 no bgp ebgp-requires-policy
 neighbor 192.168.0.2 remote-as 200
 neighbor 192.168.1.3 remote-as 300
 !
 address-family ipv4 unicast
  network 10.1.0.0/24
  network 10.151.0.0/24
  network 10.151.1.0/24
  network 10.151.2.0/24
  network 172.16.1.0/24
  network 172.16.2.0/24
  network 192.168.0.0/24
  network 192.168.1.0/24
  neighbor 192.168.0.2 route-map EBGP_200_IN in
  neighbor 192.168.0.2 route-map EBGP_200_OUT out
  neighbor 192.168.1.3 route-map EBGP_300_IN in
  neighbor 192.168.1.3 route-map EBGP_300_OUT out
 exit-address-family
exit
!
router ospf
 ospf router-id 10.151.0.1
 default-information originate always
exit
!
route-map EBGP_200_IN permit 10
 set local-preference 200
exit
!
route-map EBGP_200_OUT permit 10
 match origin igp
exit
!
route-map EBGP_300_IN permit 10
exit
!
route-map EBGP_300_OUT permit 10
 match origin igp
exit
!
end

R1_1# sh run
Building configuration...

Current configuration:
!
frr version 8.1
frr defaults traditional
hostname R1_1
no ipv6 forwarding
service integrated-vtysh-config
!
interface eth0
 ip address 10.1.0.1/24
 ip ospf area 0
exit
!
interface eth1
 ip address 172.16.1.1/24
 ip ospf area 0
exit
!
interface lo
 ip address 10.151.1.1/24
exit
!
router ospf
 ospf router-id 10.151.1.1
exit
!
end

R1_2# sh run
Building configuration...

Current configuration:
!
frr version 8.1
frr defaults traditional
hostname R1_2
no ipv6 forwarding
service integrated-vtysh-config
!
interface eth0
 ip address 10.1.0.2/24
 ip ospf area 0
exit
!
interface eth1
 ip address 172.16.2.1/24
 ip ospf area 0
exit
!
interface lo
 ip address 10.151.2.1/24
exit
!
router ospf
 ospf router-id 10.151.2.1
exit
!
end

R2# sh run
Building configuration...

Current configuration:
!
frr version 8.1
frr defaults traditional
hostname R2
no ipv6 forwarding
service integrated-vtysh-config
!
interface eth0
 ip address 10.2.0.10/24
 ip ospf area 0
exit
!
interface eth1
 ip address 192.168.0.2/24
exit
!
interface eth2
 ip address 192.168.2.2/24
exit
!
interface lo
 ip address 10.152.0.1/24
exit
!
router bgp 200
 no bgp ebgp-requires-policy
 neighbor 192.168.0.1 remote-as 100
 neighbor 192.168.2.3 remote-as 300
 !
 address-family ipv4 unicast
  network 10.2.0.0/24
  network 10.152.0.0/24
  network 10.152.1.0/24
  network 10.152.2.0/24
  network 172.17.1.0/24
  network 172.17.2.0/24
  network 192.168.0.0/24
  network 192.168.2.0/24
  neighbor 192.168.0.1 route-map EBGP_100_IN in
  neighbor 192.168.0.1 route-map EBGP_100_OUT out
  neighbor 192.168.2.3 route-map EBGP_300_IN in
  neighbor 192.168.2.3 route-map EBGP_300_OUT out
 exit-address-family
exit
!
router ospf
 ospf router-id 10.152.0.1
 default-information originate always
exit
!
route-map EBGP_100_IN permit 10
exit
!
route-map EBGP_100_OUT permit 10
 match origin igp
exit
!
route-map EBGP_300_IN permit 10
exit
!
route-map EBGP_300_OUT permit 10
 match origin igp
exit
!
end

R2_1# sh run
Building configuration...

Current configuration:
!
frr version 8.1
frr defaults traditional
hostname R2_1
no ipv6 forwarding
service integrated-vtysh-config
!
interface eth0
 ip address 10.2.0.1/24
 ip ospf area 0
exit
!
interface eth1
 ip address 172.17.1.1/24
 ip ospf area 0
exit
!
interface lo
 ip address 10.152.1.1/24
exit
!
router ospf
 ospf router-id 10.152.1.1
exit
!
end

R2_2# sh run
Building configuration...

Current configuration:
!
frr version 8.1
frr defaults traditional
hostname R2_2
no ipv6 forwarding
service integrated-vtysh-config
!
interface eth0
 ip address 10.2.0.2/24
 ip ospf area 0
exit
!
interface eth1
 ip address 172.17.2.1/24
 ip ospf area 0
exit
!
interface lo
 ip address 10.152.2.1/24
exit
!
router ospf
 ospf router-id 10.152.2.1
exit
!
end

R3# sh run
Building configuration...

Current configuration:
!
frr version 8.1
frr defaults traditional
hostname R3
no ipv6 forwarding
service integrated-vtysh-config
!
interface eth0
 ip address 10.3.0.10/24
 ip ospf area 0
exit
!
interface eth1
 ip address 192.168.1.3/24
exit
!
interface eth2
 ip address 192.168.2.3/24
exit
!
interface lo
 ip address 10.153.0.1/24
exit
!
router bgp 300
 no bgp ebgp-requires-policy
 neighbor 192.168.1.1 remote-as 100
 neighbor 192.168.2.2 remote-as 200
 !
 address-family ipv4 unicast
  network 10.3.0.0/24
  network 10.153.0.0/24
  network 10.153.1.0/24
  network 10.153.2.0/24
  network 172.18.1.0/24
  network 172.18.2.0/24
  network 192.168.1.0/24
  network 192.168.2.0/24
  neighbor 192.168.1.1 route-map EBGP_100_IN in
  neighbor 192.168.1.1 route-map EBGP_100_OUT out
  neighbor 192.168.2.2 route-map EBGP_200_IN in
  neighbor 192.168.2.2 route-map EBGP_200_OUT out
 exit-address-family
exit
!
router ospf
 ospf router-id 10.153.0.1
 default-information originate always
exit
!
route-map EBGP_200 permit 10
 match origin igp
exit
!
route-map EBGP_100_IN permit 10
exit
!
route-map EBGP_100_OUT permit 10
 match origin igp
exit
!
route-map EBGP_200_IN permit 10
exit
!
route-map EBGP_200_OUT permit 10
 match origin igp
exit
!
end

R3_1# sh run
Building configuration...

Current configuration:
!
frr version 8.1
frr defaults traditional
hostname R3_1
no ipv6 forwarding
service integrated-vtysh-config
!
interface eth0
 ip address 10.3.0.1/24
 ip ospf area 0
exit
!
interface eth1
 ip address 172.18.1.1/24
 ip ospf area 0
exit
!
interface lo
 ip address 10.153.1.1/24
exit
!
router ospf
 ospf router-id 10.153.1.1
exit
!
end

R3_2# sh run
Building configuration...

Current configuration:
!
frr version 8.1
frr defaults traditional
hostname R3_2
no ipv6 forwarding
service integrated-vtysh-config
!
interface eth0
 ip address 10.3.0.2/24
 ip ospf area 0
exit
!
interface eth1
 ip address 172.18.2.1/24
 ip ospf area 0
exit
!
interface lo
 ip address 10.153.2.1/24
exit
!
router ospf
 ospf router-id 10.153.2.1
exit
!
end